Thousand555/remote-upgrade-system/firmware/esp32_gateway/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3-WROOM-1-N16R8: 16 MiB Quad Flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# CONFIG_ESPTOOLPY_OCT_FLASH is not set

# ESP32-S3-WROOM-1-N16R8: 8 MiB Octal PSRAM at the stable 80 MHz setting.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# M7 uses a named custom partition for the cached STM32 image.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# ESP32-S3-WROOM-1-N16R8 development board pinout:
# GPIO17 -> STM32 USART1 RX (PA10), GPIO18 <- STM32 USART1 TX (PA9).
CONFIG_GATEWAY_UPGRADE_UART_NUM=1
CONFIG_GATEWAY_UPGRADE_UART_TX_GPIO=17
CONFIG_GATEWAY_UPGRADE_UART_RX_GPIO=18
CONFIG_GATEWAY_CONSOLE_ENABLE=y
